[
  {
    "id": 1,
    "title": "KTCCAR",
    "description": "Création d’un site fullstack dédié aux passionnés d’automobile. Développement du front-end avec React.js et du back-end avec Nest.js, incluant la mise en place d’un espace membre, de fonctionnalités interactives et d’un design moderne responsive.",
    "image": "/assets/ktccar.png",
    "tags": ["Tout", "Web"],
    "urlProjet": "https://github.com/emrektc70/ktccar_backoffice",
    "previewUrl": "",
    "date": "2023"
  },
  {
    "id": 2,
    "title": "Orgavita",
    "description": "Maintenance et amélioration du site Orgavita au sein d’Orgamy. Intégration de nouvelles fonctionnalités, correction de bugs et optimisation de l’interface afin d’améliorer l’expérience utilisateur des praticiens et des patients.",
    "image": "/assets/orgavita.png",
    "tags": ["Tout", "Web"],
    "urlProjet": "",
    "previewUrl": "",
    "date": "2023"
  },
  {
    "id": 3,
    "title": "ToshoBox",
    "description": "Contribution au développement de ToshoBox, une plateforme de vente de mangas en ligne. Intégration du front-end à partir des maquettes UI et mise en place des composants dynamiques pour une expérience utilisateur fluide.",
    "image": "/assets/toshoBox.png",
    "tags": ["Tout", "Web"],
    "urlProjet": "",
    "previewUrl": "",
    "date": "2023"
  },
  {
    "id": 4,
    "title": "KTCCAR API",
    "description": "Développement du backend de KTCCAR avec Nest.js. Conception d’une architecture modulaire, mise en place de la gestion des utilisateurs et intégration d’API sécurisées pour la communication front/back.",
    "image": "/assets/info1.jpg",
    "tags": ["Tout"],
    "urlProjet": "",
    "previewUrl": "",
    "date": "2023"
  },
  {
    "id": 6,
    "title": "Tom",
    "description": "Participation au développement de l’application Tom en tant que développeur Front-End au sein de Studiosystems. J’ai contribué à l’évolution des fonctionnalités, à l’optimisation des performances et à la modernisation de l’interface utilisateur pour offrir une expérience fluide et réactive.",
    "image": "/assets/tom.png",
    "tags": ["Tout", "Web"],
    "urlProjet": "",
    "previewUrl": "https://www.studiosystems.fr/tom",
    "date": "2025"
  },
  {
    "id": 7,
    "title": "Tom-mobile",
    "description": "Développement de l’application mobile Tom avec React Native. J’ai implémenté les principales fonctionnalités issues de la version web et conçu des interfaces responsives et performantes pour Android et iOS, en veillant à une excellente expérience utilisateur.",
    "image": "/assets/tom-mobile.png",
    "tags": ["Tout", "Mobile"],
    "urlProjet": "",
    "previewUrl": "https://www.studiosystems.fr/tom",
    "date": "2025"
  },
  {
    "id": 8,
    "title": "La Lampe d'Aladin & co",
    "description": "Participation au développement de l’application mobile La Lampe d’Aladin & co avec React Native. J’ai contribué à la création d’interfaces modernes et intuitives et à l’intégration des fonctionnalités clés, tout en assurant une bonne performance sur les deux plateformes mobiles.",
    "image": "/assets/aladin.png",
    "tags": ["Tout", "Mobile"],
    "urlProjet": "",
    "previewUrl": "https://www.studiosystems.fr/aladin",
    "date": "2025"
  },
  {
    "id": 9,
    "title": "Avisplaie",
    "description": "Conception et intégration d’interfaces mobiles pour Avisplaie avec React Native. J’ai assuré la mise en place des fonctionnalités principales et optimisé la fluidité et la performance de l’application sur Android et iOS.",
    "image": "/assets/avisplaie.png",
    "tags": ["Tout", "Mobile"],
    "urlProjet": "",
    "previewUrl": "https://www.studiosystems.fr/avisplaie",
    "date": "2025"
  },
  {
    "id": 10,
    "title": "IDevis",
    "description": "IDevis est une application que j'ai développée en React Native et TypeScript avec Expo. C'est un projet entièrement personnel qui permet de s'authentifier, de créer des devis et de les générer en PDF.",
    "image": "/assets/idevis.png",
    "tags": ["Tout", "Mobile"],
    "urlProjet": "",
    "previewUrl": "",
    "date": "2024"
  },
  {
    "id": 11,
    "title": "IDevis Back",
    "description": "IDevis Back est le backend que j'ai développé pour l'application IDevis en utilisant NestJS et TypeScript. Ce projet entièrement personnel gère l'authentification des utilisateurs, la création et la gestion des devis.",
    "image": "/assets/idevis.png",
    "tags": ["Tout"],
    "urlProjet": "",
    "previewUrl": "",
    "date": "2024"
  },
  {
    "id": 12,
    "title": "Oneday Patient",
    "description": "Oneday Patient est une application mobile qui permet de gérer les rendez-vous avec les chirurgiens et de faciliter le suivi des dossiers d’admission. Elle aide les patients et le personnel médical à gagner du temps et à organiser efficacement les consultations.",
    "image": "/assets/oneday.png",
    "tags": ["Tout", "Mobile"],
    "urlProjet":"",
    "previewUrl": "https://www.studiosystems.fr/oneday-patient",
    "date": "2025"
  },
  {
    "id": 13,
    "title": "Oneday",
    "description": "Oneday est un logiciel destiné aux chirurgiens pour planifier et gérer les opérations et le suivi des patients de manière automatisée. Il optimise l’organisation des interventions et améliore l’efficacité du personnel médical.",
    "image": "/assets/oneday.png",
    "tags": ["Tout", "Web"],
    "urlProjet": "",
    "previewUrl": "https://www.studiosystems.fr/oneday-patient",
    "date": "2024"
  },
  {
    "id": 14,
    "title": "EDK Event",
    "description": "EDK Event est un site vitrine en cours de développement, conçu pour présenter un projet événementiel. Le site met en avant les informations principales et prépare le lancement officiel du projet.",
    "image": "/assets/edk.png",
    "tags": ["Tout", "Web"],
    "urlProjet": "",
    "previewUrl": "https://edk-event.vercel.app/",
    "date": "2025"
  }
]
